{
  "app": {
    "name": "Pluralsight Support Assist",
    "short_description": "Bring your KnowledgeOwl knowledge base into Zendesk Support tickets.",
    "long_description": "KnowledgeOwl Support Assist brings your knowledge base into Zendesk tickets.\n- Suggest answers \n- Search the knowledge base\n- Insert links to articles\n- Create new articles from tickets\n\n### Suggest answers\nThe app searches for articles in your knowledge base using the ticket subject. Relevant articles will display to the right of the ticket.\nAgents can click any suggested article to view them. The **Insert** option will add a link in the reply to the customer.\n### Search the knowledge base\nAgents can search for knowledge base articles without leaving the ticket. Agents can click any suggested article to view them. The **Insert** option will add a link in the reply to the customer.\n### Insert links to articles\nAgents can insert links to relevant knowledge base articles without leaving a ticket. Insert links from suggested answers and search results.\n### Create new articles from tickets\nThe app allows agents to create new articles while replying to tickets. You can customize the status and category in which agent-created articles will appear.\n\nSince the app uses the API, there’s no need for extra KnowledgeOwl users for your support agents. Use this feature to capture knowledge from agents and build your knowledge base.\n## About KnowledgeOwl\nThousands of people use KnowledgeOwl to create and manage knowledge bases. Create a knowledge base that matches your brand’s look and feel. Take advantage of Enterprise-grade features and premium services. Best of all? KnowledgeOwl integrates with Zendesk to provide you with the best of both worlds.\n\nVisit the website to learn more about KnowledgeOwl and try our [knowledge base software](https://www.knowledgeowl.com/home).",
    "installation_instructions" : "1. Log in to Zendesk Support and go to **Admin** > **Apps** > **Marketplace**.\n2. Find and click the KnowledgeOwl Support Assist app, then click **Install**. Select your Zendesk account and click **Install** again.\n3. Input your API key, knowledge base ID, and the max number of articles to return in search. \n    - **API key with GET and POST access:** Admins can create API keys under **Your Account** > **API** in KnowledgeOwl. You only need POST access if you allow agents to create articles.\n    - **Knowledge base ID:** Your knowledge base ID displays in application URLs. Go to **Settings** > **Basic**. The knowledge base ID will be at the end of the URL: https://app.knowledgeowl.com/kb/settings/id/**<kb_id>**\n    - **Max number of articles returned by search:** Control how many results to display in search. Must be a number between 1 and 20.\n    - **Exclude all searches from KO reporting:** Removes agent searches from within Zendesk from Searches with No Results report. \n4. (Optional) Specify how the app should handle restricted content. By default, the app will only display articles without any restrictions. Choose only one option below.\n    - **Include all restricted content in search:** Choose to include all restricted articles in suggestions and searches.  This overrides any specified reader groups.\n    - **Include restricted content from the following reader groups:**  Choose to include restricted articles from specified reader groups.  Reader group IDs display under **Your Account** > **Readers** > **Groups**. Separate reader group IDs with commas. **Include all restricted content in search** overrides this setting.\n5. (Optional) **Allow agents to create articles from ticket replies:** Allow agents to create KnowledgeOwl articles from inside Zendesk tickets. Agents do not need a KnowledgeOwl user login to use this feature. Requires POST access on the API key.\n    - **Category ID for new articles:** Specify where to create new articles. Your category ID displays in application URLs. Go to the category under **Knowledge Base** > **Manage**. The categoryID displays at the end of the URL: https://app.knowledgeowl.com/kb/category/id/<kb_id>/cid/**<category_id>** \n    - **Publishing status for new articles:** Select which status to apply to articles created by Zendesk agents. Possible article statuses are Draft, Ready to Publish, Published, and Needs Review.\n6. Click **Install** and go to a Zendesk ticket. The KnowledgeOwl Support Assist app will display in the sidebar. Click on **Apps** to show or hide the sidebar.",	
    "parameters": {
		"apikey" : { "label": "KnowledgeOwl API key with GET and POST access."},
		"kbid" : {"label": "Knowledge base ID"},
		"ignoreSearchResults": {"label": "Exclude all searches from KO reporting"},
		"articlelimit" : {"label": "The max number of articles returned by search (1-20)"},
		"restrictedArticles" : {"label": "Include all restricted content in searches"},
		"readerGroups" : {"label": "Include restricted content from the following reader groups"},
		"allowcreate" : {"label": "Allow agents to create articles from ticket replies"},
		"createcategory" : {"label": "Category ID for new articles"},
		"artstatus" : {"label": "Publishing status for new articles"}
	}
  }
}
